testcase/rice_2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//#include "solverControls"

libs            (MassTransferCoupled);

application     kernelPhaseTransition4FOAM;

startFrom       startTime;

startTime       1000;

stopAt          endTime;

endTime         2400;

deltaT          1e-3;

writeControl    adjustable;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

maxCo           0.8;

maxDi           10.0;

adjustTimeStep  yes;

// ************************************************************************* //
functions
{
  solverInfo
  {
    type            solverInfo;
    libs            ("libutilityFunctionObjects.so");
    enabled         true;
    writeControl    none;
    region          fluid;
    fields          (p_rgh);
    writeResidualFields yes;
  }
}


