testcase/rice_2D/constant/fluid/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       6112;
    }
    oulet
    {
        type            patch;
        nFaces          10;
        startFace       6122;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       6132;
    }
    front
    {
        type            empty;
        inGroups        1(wall);
        nFaces          3064;
        startFace       6172;
    }
    back
    {
        type            empty;
        inGroups        1(wall);
        nFaces          3064;
        startFace       9236;
    }
    fluid_to_kernel
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          218;
        startFace       12300;
        sampleMode      nearestPatchFace;
        sampleRegion    kernel;
        samplePatch     kernel_to_fluid;
    }
)

// ************************************************************************* //
