testcase/rice_2D/constant/fluid/thermo.compressibleGas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermo.compressibleGas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


AIR
{
    specie
    {
        nMoles          1;
        molWeight       28.96;
    }
    thermodynamics
    {
        Cv              717;
	    Cp              1004.4;
        Hf              0;
    }
    equationOfState
    {
        rho             1.29;
        pRef            1e5;
    }
    transport
    {
        mu 	            1.831e-5;
        Pr	            0.72;
    }
}

/*
AIR
{
    specie
    {
        molWeight       28.0134;
    }
    thermodynamics
    {
        Cp              1005;
        Hf              0;
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.92664 0.00148798 -5.68476e-07 1.0097e-10 -6.75335e-15 -922.798 5.98053 );
        lowCpCoeffs     ( 3.29868 0.00140824 -3.96322e-06 5.64152e-09 -2.44486e-12 -1020.9 3.95037 );

    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}
*/

H2O
{
    specie
    {
        nMoles          1;
        molWeight       18.02;
    }
    thermodynamics
    {
      	Cp              2018.0;
        Cv              1514.76;
        Hf              0;
    }
    equationOfState
    {
        rho         0.557;
        pRef        1e5;
    }
    transport
    {
        mu 	        1.3e-5;
        Pr	        0.95;
    }
}

/*
H2O
{
    specie
    {
        molWeight       18.0153;
    }
    thermodynamics
    {
        Cp              1875;
        Hf              0;
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.67215 0.00305629 -8.73026e-07 1.201e-10 -6.39162e-15 -29899.2 6.86282 );
        lowCpCoeffs     ( 3.38684 0.00347498 -6.3547e-06 6.96858e-09 -2.50659e-12 -30208.1 2.59023 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}
*/

// ************************************************************************* //
