testcase/rice_2D/constant/kernel/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/kernel/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    front
    {
        type            empty;
        inGroups        1(wall);
        nFaces          746;
        startFace       1454;
    }
    back
    {
        type            empty;
        inGroups        1(wall);
        nFaces          746;
        startFace       2200;
    }
    kernel_to_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          218;
        startFace       2946;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_kernel;
    }
)

// ************************************************************************* //
