testcase/rice_2D/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0.1);
    }

    fixedWalls
    {
        type            noSlip;
    }

    oulet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    fluid_to_kernel
    {
        type            noSlip;
        //value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
