testcase/rice_2D/0/fluid/H2O
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.002;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet
    {
        type            fixedValue;
        value           uniform 0.002;
    }

    oulet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }

    fixedWalls
    {
        type            zeroGradient; 
    }

    fluid_to_kernel
    {
        type            fixedGradient;    
        //type            fixedValue;
        gradient        uniform 0.0;    
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}
