testcase/rice_2D/0/fluid/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    oulet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }

    fixedWalls
    {
        type            zeroGradient; 
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    fluid_to_kernel
    {
        type            zeroGradient;    
    }
}
