testcase/rice_2D/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system/fluid";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
	smoother	GaussSeidel;
	nPreSweeps	0;
	nPostSweeps	2;
	nFinestSweeps	2;
	cacheAgglomeration true;
	nCellsInCoarsestLevel 10;
	agglomerator	faceAreaPair;
	mergeLevels	1;
    }
    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    rho
    {
        solver          PCG;
	preconsitioner  DIC;
	tolerance	1e-5;
	relTol		0.1;
    }
    rhoFinal
    {
        $rho;
        tolerance       1e-05;
        relTol          0;
    }   

    "(U|h|k|epsilon|R)"
    {
        solver      PBiCGStab;
        preconditioner DILU;
        tolerance   1e-5;
        relTol      0.01;
    }
    
    "(U|h|k|epsilon|R)Final"
    {
        $U
        tolerance   1e-5;
        relTol      0;
    }
    Yi
    {
        $U;
    }
    YiFinal
    {
        $UFinal;
    }
    H2O
    {
        $U;
    }
    H2OFinal
    {
        $U;
        relTol          0;
    }
	
}

PIMPLE
{
    momentumPredictor   no;
    nCorrectors     2;
    nNonOrthogonalCorrectors    0;
    pRefCell 		0;
    pRefValue		1e5;
}
relaxationFactors
{
    equations
    {
        ".*"                    1;
    }
    /*
    equations
    {
        "U(x|y|z)"              0.7;
        "U"                     0.7;
        "UFinal"                1.0;
        "U(x|y|z)Final"         1.0;
        "H2O"                   0.5;
        "H2OFinal"              1.0;
        "h"                     0.5;
        "k|epsilon|G|omega"     0.25;
        "(k|epsilon|h|G|omega)Final"    1.0;
   }*/
}


// ************************************************************************* //
