testcase/rice_2D/system/kernel/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system/kernel";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    h
    {
        solver      PCG;
        preconditioner DIC;
        tolerance   1e-7;
        relTol      0.01;
    }
    hFinal
    {
        $h;
        tolerance   1e-7;
        relTol      0;
    }
    H2O
    {
		$h
    }
    H2OFinal
    {
        $H2O
        tolerance   1e-7;
        relTol      0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors    0;
}

// ************************************************************************* //
